zupcorp23012025.Расширение1/src/Reports/РасчетныйЛистПоАптеке/РасчетныйЛистПоАптеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РасчетныйЛистПоАптеке</name>
</mdclass:Report>

zupcorp23012025.Расширение1/src/InformationRegisters/ПоказателиПоДолжностям/ПоказателиПоДолжностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиПоДолжностям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Минимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Максимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДиапазонаЧасов1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНочногоЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПраздники</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПраздникиНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоплатаЗаКатегорию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияНочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонЧасов1До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонЧасов2До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДиапазонаЧасов2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонЧасов3До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДиапазонаЧасов3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВыходные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПринятогоЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьСобраннойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияСотрудник</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияАптеки</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zupcorp23012025.Расширение1/src/InformationRegisters/ДанныеПоАптекам/ДанныеПоАптекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоАптекам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходныеВремяДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПраздникиВремяДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПраздникиВремяНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаОценку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусСроковые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусПоДМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаЛичнуюВыручку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаСовмещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВидыСтатусов</types>
    </type>
  </resources>
  <resources>
    <name>ЛичнаяВыручкаНеДТМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛичнаяВыручкаДТМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уволенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОценкаТекст</name>
    <type>
      <types>EnumRef.ВидыОценок</types>
    </type>
  </resources>
  <resources>
    <name>Среднечасовое1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Среднечасовое2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажСрокиИЗМЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактПродажМУЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактПродажМУЗаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланМУСреднечасовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажТоваровНаПродвижении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательKPI1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательKPI2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияKPI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолПринятыхЗвонков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗвонки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолСобранныхУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусСтрокиЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУслугВрача</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаУслугиВрача</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОчковыеЛинзы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаОчковыеЛинзы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛичнаяВыручкаОптика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаОптику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеРаботы</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрядКатегория</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрядПодразделение</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zupcorp23012025.Расширение1/src/Reports/РасчетныйЛистПоАптеке/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период");
	Если ПараметрПериод.Использование Тогда
		Период1 = ПараметрПериод.Значение;
	Иначе
		Период1 = Дата(2024,01,01,00,00,00);
	КонецЕсли; 
	ПараметрПодразделение = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Подразделение");
	Если ПараметрПодразделение.Использование Тогда
		Подразделение = ПараметрПодразделение.Значение;
	Иначе
		Подразделение =Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
		
	//Отображаем только данные по подразоделению в котором работает текущий пользователь_н
	ОграничитьДоступ=Истина;
	Если РольДоступна("ЗГ_НачислениеЗП") или РольДоступна("АдминистраторСистемы") или РольДоступна("ПолныеПрава") Тогда
		ОграничитьДоступ=Ложь;
	КонецЕсли;
	Если ОграничитьДоступ Тогда	
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		ФизическоеЛицо=ТекПользователь.ФизическоеЛицо;
		//ФизическоеЛицо=Справочники.ФизическиеЛица.НайтиПоНаименованию("Прудских Юлия Игоревна");
		Запрос3 = Новый Запрос;
		Запрос3.Текст = 
		"ВЫБРАТЬ 
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
		|	И НЕ Сотрудники.ПометкаУдаления";
		
		Запрос3.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
		СотрудникиМассив=Запрос3.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Таблица1=КадровыйУчет.КадровыеДанныеСотрудников(Истина,СотрудникиМассив,"ФизическоеЛицо,Сотрудник,Подразделение");
		Таблица1.Свернуть("Подразделение");
		//МассивПодразделений=Таблица1.ВыгрузитьКолонку("Подразделение");
		ПараметрыПоиска=Новый Структура;
		ПараметрыПоиска.Вставить("Подразделение",Подразделение);
		МассивПодразделений=Таблица1.НайтиСтроки(ПараметрыПоиска);
		Если МассивПодразделений.Количество()=0 Тогда
			Подразделение=Справочники.ПодразделенияОрганизаций.ПустаяСсылка(); 
			Сообщить("По данному подразделению запрещено делать отчет, можно только по подразделению в котором работает сотрудник");
			
		КонецЕсли;
		//Запрос.УстановитьПараметр("ДоступныеПодразделения",МассивПодразделений);
	КонецЕсли;
	//текущий пользователь_К
	
	
	//
	//ПараметрВышестоящееПодразделение = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ВышестоящееПодразделение");
	//Если ПараметрВышестоящееПодразделение.Использование Тогда
	//	ВышестоящееПодразделение = ПараметрВышестоящееПодразделение.Значение;
	//Иначе
	//	ВышестоящееПодразделение = Неопределено;
	//КонецЕсли;
	ДатаНачала=Период1.ДатаНачала;
	ДатаОкончания=Период1.ДатаОкончания;
	ПараметрыПодключения = ЗГ_ПроцедурыИФункцииСервер.ПолучитьПараметрыПодключения("ЗУП ПРОФ 3.1");
	Если НЕ ЗначениеЗаполнено(ПараметрыПодключения.Сервер) Тогда
		ВызватьИсключение "Не найдены параметры подключения к базе «ЗУП ПРОФ»";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер,, ПараметрыПодключения.Пользователь, ПараметрыПодключения.Пароль);
	ЗапросHTTP = Новый HTTPЗапрос("/"+ПараметрыПодключения.ПубликацияНаВебСервере+"/hs/api/test");
	ОтветHTTP = Соединение.Получить(ЗапросHTTP);
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ВызватьИсключение "Произошла ошибка при подключении к базе «ЗУП ПРОФ» ";
	КонецЕсли;
	//Получаем из ЗУП стоимость отпусков Н_ 
	//ДатаНачала=Дата(2024,10,1);
	//ДатаОкончания=Дата(2024,10,31);
	//Подразделение=Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("Аптека Здоровый Город №12");
	
	ТаблицаОтпуска=Новый ТаблицаЗначений;
	//"Сотрудник,ДатаНачала,ДатаОкончания,КоличествоДней,Сумма,ЭтоКомпенсация,Должность,ИНН"
	ТаблицаОтпуска.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка", ,,, Новый КвалификаторыСтроки(20)));
	ТаблицаОтпуска.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число"));
	ТаблицаОтпуска.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый HTTPЗапрос(СтрШаблон("/"+ПараметрыПодключения.ПубликацияНаВебСервере+"/hs/api/oplataotpusk/%1",Формат(ДатаНачала, "ДФ=yyyyMMdd")));
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		Данные1 = ПрочитатьJSON(Чтение);
		Для Каждого Стр Из Данные1 Цикл
			Нов = ТаблицаОтпуска.Добавить();
			//Нов.Период=Дата(СтрЗаменить(Лев(Стр.Период,10),"-",""));
			Нов.ИНН=Стр.ИНН;
			Нов.КоличествоДней=Стр.КоличествоДней;
			Нов.Сумма=Стр.Сумма;
		КонецЦикла
	КонецЕсли;
	ТаблицаОтпуска.Свернуть("ИНН","КоличествоДней,Сумма");
	//Получаем и ЗУП стоимость отпусков _К
	
	//Получаем из ЗУП стоимость больничных Н_
	ТаблицаБольничные=Новый ТаблицаЗначений;
	//"ФизическоеЛицо,ИНН,НомерЛН,ДатаНачала,ДатаОкончания,КоличествоДней,СуммаФинансируемаяФСС,СуммаФинансируемаяРаботодателем"
	ТаблицаБольничные.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка", ,,, Новый КвалификаторыСтроки(20)));
	ТаблицаБольничные.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число"));
	ТаблицаБольничные.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Запрос = Новый HTTPЗапрос(СтрШаблон("/"+ПараметрыПодключения.ПубликацияНаВебСервере+"/hs/api/oplataboll/%1",Формат(ДатаНачала, "ДФ=yyyyMMdd")));
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		Данные2 = ПрочитатьJSON(Чтение);
		Для Каждого Стр Из Данные2 Цикл
			Нов = ТаблицаБольничные.Добавить();
			//Нов.Период=Дата(СтрЗаменить(Лев(Стр.Период,10),"-",""));
			Нов.ИНН=Стр.ИНН;
			Нов.КоличествоДней=Стр.КоличествоДней;
			Нов.Сумма=Стр.СуммаФинансируемаяРаботодателем;
		КонецЦикла
	КонецЕсли;
	ТаблицаБольничные.Свернуть("ИНН","КоличествоДней,Сумма");
	//Получаем и ЗУП стоимость больничных _К 
	
	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Больничные",ТаблицаБольничные);
	Запрос.УстановитьПараметр("Отпуска",ТаблицаОтпуска);
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Больничные.ИНН КАК ИНН,
		|	Больничные.КоличествоДней КАК КоличествоДней,
		|	Больничные.Сумма КАК Сумма
		|ПОМЕСТИТЬ Больничные
		|ИЗ
		|	&Больничные КАК Больничные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отпуска.ИНН КАК ИНН,
		|	Отпуска.КоличествоДней КАК КоличествоДней,
		|	Отпуска.Сумма КАК Сумма
		|ПОМЕСТИТЬ Отпуска
		|ИЗ
		|	&Отпуска КАК Отпуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоАптекам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеПоАптекам.Подразделение КАК Подразделение,
		|	ДанныеПоАптекам.Должность КАК Должность,
		|	ДанныеПоАптекам.РазрядКатегория КАК РазрядКатегория,
		|	ДанныеПоАптекам.ВремяДень - ДанныеПоАптекам.ПраздникиВремяДень КАК ВремяДень,
		|	ПоказателиПоДолжностямСрезПоследних.СтоимостьДиапазонаЧасов1 КАК СтоимостьДень,
		|	ОКР((ДанныеПоАптекам.ВремяДень - ДанныеПоАптекам.ПраздникиВремяДень) * ПоказателиПоДолжностямСрезПоследних.СтоимостьДиапазонаЧасов1 * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК СуммаДень,
		|	ПоказателиПоДолжностямСрезПоследних.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию,
		|	ОКР((ДанныеПоАптекам.ВремяДень - ДанныеПоАптекам.ПраздникиВремяДень) * ПоказателиПоДолжностямСрезПоследних.ДоплатаЗаКатегорию * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ДоплатаЗаКатегориюСумма,
		|	ДанныеПоАптекам.ВремяНочь - ДанныеПоАптекам.ПраздникиВремяНочь КАК ВремяНочь,
		|	ПоказателиПоДолжностямСрезПоследних.СтоимостьНочногоЧаса КАК СтоимостьНочногоЧаса,
		|	ОКР((ДанныеПоАптекам.ВремяНочь - ДанныеПоАптекам.ПраздникиВремяНочь) * ПоказателиПоДолжностямСрезПоследних.СтоимостьНочногоЧаса * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК СуммаНочь,
		|	ПоказателиПоДолжностямСрезПоследних.ПремияНочная КАК ПремияНочная,
		|	ОКР((ДанныеПоАптекам.ВремяНочь - ДанныеПоАптекам.ПраздникиВремяНочь) * ПоказателиПоДолжностямСрезПоследних.ПремияНочная * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ПремияНочнаяСумма,
		|	ДанныеПоАптекам.ПраздникиВремяДень КАК ПраздникиВремяДень,
		|	ПоказателиПоДолжностямСрезПоследних.СтоимостьПраздники КАК СтоимостьПраздники,
		|	ОКР(ДанныеПоАптекам.ПраздникиВремяДень * ПоказателиПоДолжностямСрезПоследних.СтоимостьПраздники * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК СуммаПраздникиДень,
		|	ДанныеПоАптекам.ПраздникиВремяНочь КАК ПраздникиВремяНочь,
		|	ПоказателиПоДолжностямСрезПоследних.СтоимостьПраздникиНочь КАК СтоимостьПраздникиНочь,
		|	ОКР(ДанныеПоАптекам.ПраздникиВремяНочь * ПоказателиПоДолжностямСрезПоследних.СтоимостьПраздникиНочь * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК СуммаПраздникиНочь,
		|	ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ КАК ЛичнаяВыручкаНеДТМ,
		|	ВЫБОР
		|		КОГДА ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ <> 0
		|			ТОГДА ОКР(ДанныеПоАптекам.БонусЗаЛичнуюВыручку / ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ * 100, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоказательНеДТМ1,
		|	ДифференциацияБонусаПоСетиСрезПоследних.Бонус1 КАК ПоказательНеДТМ,
		|	ОКР(ДанныеПоАптекам.БонусЗаЛичнуюВыручку * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ПремияНеДТМ,
		|	ДанныеПоАптекам.ЛичнаяВыручкаДТМ КАК ЛичнаяВыручкаДТМ,
		|	ВЫБОР
		|		КОГДА ДанныеПоАптекам.ЛичнаяВыручкаДТМ <> 0
		|			ТОГДА ОКР(ДанныеПоАптекам.БонусПоДМ / ДанныеПоАптекам.ЛичнаяВыручкаДТМ * 100, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоказательДТМ1,
		|	ДифференциацияБонусаПоСетиСрезПоследних.Бонус2 КАК ПоказательДТМ,
		|	ОКР(ДанныеПоАптекам.БонусПоДМ * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ПремияДТМ,
		|	ДанныеПоАптекам.ЛичнаяВыручкаОптика КАК ЛичнаяВыручкаОптика,
		|	ВЫБОР
		|		КОГДА ДанныеПоАптекам.ЛичнаяВыручкаОптика <> 0
		|			ТОГДА ОКР(ДанныеПоАптекам.БонусЗаОптику / ДанныеПоАптекам.ЛичнаяВыручкаОптика * 100, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоказательОптики1,
		|	ДифференциацияБонусаПоСетиСрезПоследних.Бонус1Оптика КАК ПоказательОптики,
		|	ОКР(ДанныеПоАптекам.БонусЗаОптику * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ПремияОптики,
		|	ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении КАК СуммаПродажТоваровНаПродвижении,
		|	ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ КАК СуммаПродажСрокиИЗМЗ,
		|	ОКР(ДанныеПоАптекам.БонусЗаСовмещение * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ПремияЗаСовмещение,
		|	ПоказателиПоДолжностямСрезПоследних.Коэффициент КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА ПоказателиПоДолжностямСрезПоследних.НормаЧасов <> 0
		|			ТОГДА ОКР(ПоказателиПоДолжностямСрезПоследних.Минимум * (ДанныеПоАптекам.ВремяДень + ДанныеПоАптекам.ВремяНочь) / ПоказателиПоДолжностямСрезПоследних.НормаЧасов, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК min,
		|	ВЫБОР
		|		КОГДА ПоказателиПоДолжностямСрезПоследних.НормаЧасов <> 0
		|			ТОГДА ОКР(ПоказателиПоДолжностямСрезПоследних.Максимум * (ДанныеПоАптекам.ВремяДень + ДанныеПоАптекам.ВремяНочь) / ПоказателиПоДолжностямСрезПоследних.НормаЧасов, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК max,
		|	ОКР(ДанныеПоАптекам.БонусЗвонки * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ПремияЗвонки,
		|	ОКР(ДанныеПоАптекам.БонусСтрокиЗаказов * ПоказателиПоДолжностямСрезПоследних.Коэффициент, 2) КАК ПремияСтрокиЗаказов,
		|	ДанныеПоАптекам.КолПринятыхЗвонков КАК КолПринятыхЗвонков,
		|	ДанныеПоАптекам.КолСобранныхУпаковок КАК КолСобранныхУпаковок,
		|	ПоказателиПоДолжностямСрезПоследних.СтоимостьПринятогоЗвонка КАК СтоимостьПринятогоЗвонка,
		|	ПоказателиПоДолжностямСрезПоследних.СтоимостьСобраннойУпаковки КАК СтоимостьСобраннойУпаковки
		|ПОМЕСТИТЬ ВТ_ДанныеПоАптекам_ВыбраннаяАптека
		|ИЗ
		|	РегистрСведений.ПоказателиПоДолжностям.СрезПоследних(&ДатаНачала, ) КАК ПоказателиПоДолжностямСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоАптекам КАК ДанныеПоАптекам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДифференциацияБонусаПоСети.СрезПоследних(&ДатаНачала, ) КАК ДифференциацияБонусаПоСетиСрезПоследних
		|			ПО ДанныеПоАптекам.ПодразделениеРаботы = ДифференциацияБонусаПоСетиСрезПоследних.Подразделение
		|		ПО ПоказателиПоДолжностямСрезПоследних.Должность = ДанныеПоАптекам.Должность
		|			И ПоказателиПоДолжностямСрезПоследних.КатегорияСотрудник = ДанныеПоАптекам.РазрядКатегория
		|			И ПоказателиПоДолжностямСрезПоследних.КатегорияАптеки = ДанныеПоАптекам.РазрядПодразделение
		|ГДЕ
		|	ДанныеПоАптекам.ДатаС МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ДанныеПоАптекам.ДатаПо МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ДанныеПоАптекам.ПодразделениеРаботы = &Подразделение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоАптекам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ДанныеПоАптекам.ВремяДень) КАК ВремяДень,
		|	СУММА(ДанныеПоАптекам.ВремяНочь) КАК ВремяНочь,
		|	СУММА(ДанныеПоАптекам.ПраздникиВремяДень) КАК ПраздникиВремяДень,
		|	СУММА(ДанныеПоАптекам.ПраздникиВремяНочь) КАК ПраздникиВремяНочь,
		|	СУММА(ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ) КАК ЛичнаяВыручкаНеДТМ,
		|	СУММА(ДанныеПоАптекам.БонусЗаЛичнуюВыручку) КАК БонусЗаЛичнуюВыручку,
		|	СУММА(ДанныеПоАптекам.ЛичнаяВыручкаДТМ) КАК ЛичнаяВыручкаДТМ,
		|	СУММА(ДанныеПоАптекам.БонусПоДМ) КАК БонусПоДМ,
		|	СУММА(ДанныеПоАптекам.ЛичнаяВыручкаОптика) КАК ЛичнаяВыручкаОптика,
		|	СУММА(ДанныеПоАптекам.БонусЗаОптику) КАК БонусЗаОптику,
		|	СУММА(ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении) КАК СуммаПродажТоваровНаПродвижении,
		|	СУММА(ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ) КАК СуммаПродажСрокиИЗМЗ
		|ПОМЕСТИТЬ ВТ_ДанныеПоАптекам_ОбщееПоВсемАптекам
		|ИЗ
		|	ВТ_ДанныеПоАптекам_ВыбраннаяАптека КАК ВТ_ДанныеПоАптекам_ВыбраннаяАптека
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоАптекам КАК ДанныеПоАптекам
		|		ПО ВТ_ДанныеПоАптекам_ВыбраннаяАптека.ФизическоеЛицо = ДанныеПоАптекам.ФизическоеЛицо
		|ГДЕ
		|	ДанныеПоАптекам.ДатаС МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ДанныеПоАптекам.ДатаПо МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоАптекам.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияЗППоАптекам.Период КАК Период,
		|	НачисленияЗППоАптекам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияЗППоАптекам.ОсновнаяАптека КАК ОсновноеПодразделение,
		|	НачисленияЗППоАптекам.Должность КАК Должность,
		|	НачисленияЗППоАптекам.РазрядКатегория КАК РазрядКатегория,
		|	НачисленияЗППоАптекам.ТН КАК ТН,
		|	НачисленияЗППоАптекам.ИНН КАК ИНН,
		|	НачисленияЗППоАптекам.ВсегоПоРасчету КАК ВсегоПоРасчету,
		|	НачисленияЗППоАптекам.ИтогоДоГраниц КАК ИтогоДоГраниц,
		|	НачисленияЗППоАптекам.МинимумПоФакту КАК МинимумПоФакту,
		|	НачисленияЗППоАптекам.МаксимумПоФакту КАК МаксимумПоФакту,
		|	НачисленияЗППоАптекам.ВсегоПоРасчету - НачисленияЗППоАптекам.Доплата2 - НачисленияЗППоАптекам.ИтогоДоГраниц - НачисленияЗППоАптекам.Доплата1 КАК КоррекцияПремии1,
		|	НачисленияЗППоАптекам.Доплата2 КАК КоррекцияПремии2,
		|	НачисленияЗППоАптекам.ОтработаноВсего КАК ОтработаноВсего,
		|	НачисленияЗППоАптекам.ИтогоЗаОтработанноеВремя КАК ИтогоЗаОтработанноеВремя,
		|	НачисленияЗППоАптекам.Оклад0_166_Часы КАК Оклад0_166_Часы,
		|	НачисленияЗППоАптекам.Оклад0_166Сумма КАК Оклад0_166Сумма,
		|	НачисленияЗППоАптекам.Ночь_Часы КАК Ночь_Часы,
		|	НачисленияЗППоАптекам.Ночь_Сумма КАК Ночь_Сумма,
		|	НачисленияЗППоАптекам.ПраздникиДеньЧасы КАК ПраздникиДеньЧасы,
		|	НачисленияЗППоАптекам.ПраздникиДеньСумма КАК ПраздникиДеньСумма,
		|	НачисленияЗППоАптекам.ПраздникиНочьЧасы КАК ПраздникиНочьЧасы,
		|	НачисленияЗППоАптекам.ПраздникиНочьСумма КАК ПраздникиНочьСумма,
		|	НачисленияЗППоАптекам.ИтогоБонусов КАК ИтогоБонусов,
		|	ВТ_ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ КАК ЛичнаяВыручкаНеДТМ,
		|	НачисленияЗППоАптекам.БонусНеДТМ КАК БонусНеДТМ,
		|	ВТ_ДанныеПоАптекам.ЛичнаяВыручкаДТМ КАК ЛичнаяВыручкаДТМ,
		|	НачисленияЗППоАптекам.БонусДТМ КАК БонусДТМ,
		|	ВТ_ДанныеПоАптекам.ЛичнаяВыручкаОптика КАК ЛичнаяВыручкаОптика,
		|	НачисленияЗППоАптекам.БонусЗаОптику КАК БонусЗаОптику,
		|	ВТ_ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении КАК СуммаПродажТоваровНаПродвижении,
		|	НачисленияЗППоАптекам.БонусАкции КАК БонусАкции,
		|	ВТ_ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ КАК СуммаПродажСрокиИЗМЗ,
		|	НачисленияЗППоАптекам.БонусЗМЗ КАК БонусЗМЗ,
		|	НачисленияЗППоАптекам.Доплата1 КАК Доплата1,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ <> 0
		|			ТОГДА ОКР(НачисленияЗППоАптекам.БонусНеДТМ / ВТ_ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ * 100, 4)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоказательНеДТМ,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеПоАптекам.ЛичнаяВыручкаДТМ <> 0
		|			ТОГДА ОКР(НачисленияЗППоАптекам.БонусДТМ / ВТ_ДанныеПоАптекам.ЛичнаяВыручкаДТМ * 100, 4)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоказательДТМ,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеПоАптекам.ЛичнаяВыручкаОптика <> 0
		|			ТОГДА ОКР(НачисленияЗППоАптекам.БонусЗаОптику / ВТ_ДанныеПоАптекам.ЛичнаяВыручкаОптика * 100, 4)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоказательОптика,
		|	ВЫБОР
		|		КОГДА НачисленияЗППоАптекам.Оклад0_166_Часы <> 0
		|			ТОГДА ОКР(НачисленияЗППоАптекам.Оклад0_166Сумма / НачисленияЗППоАптекам.Оклад0_166_Часы, 4)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК День1,
		|	ВЫБОР
		|		КОГДА НачисленияЗППоАптекам.Ночь_Часы <> 0
		|			ТОГДА ОКР(НачисленияЗППоАптекам.Ночь_Сумма / НачисленияЗППоАптекам.Ночь_Часы, 4)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Ночь1,
		|	ВЫБОР
		|		КОГДА НачисленияЗППоАптекам.ПраздникиДеньЧасы <> 0
		|			ТОГДА ОКР(НачисленияЗППоАптекам.ПраздникиДеньСумма / НачисленияЗППоАптекам.ПраздникиДеньЧасы, 4)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК День2,
		|	ВЫБОР
		|		КОГДА НачисленияЗППоАптекам.ПраздникиНочьЧасы <> 0
		|			ТОГДА ОКР(НачисленияЗППоАптекам.ПраздникиНочьСумма / НачисленияЗППоАптекам.ПраздникиНочьЧасы, 4)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Ночь2
		|ПОМЕСТИТЬ ВТ_ЗПОбщая
		|ИЗ
		|	РегистрСведений.НачисленияЗППоАптекам КАК НачисленияЗППоАптекам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеПоАптекам_ОбщееПоВсемАптекам КАК ВТ_ДанныеПоАптекам
		|		ПО НачисленияЗППоАптекам.ФизическоеЛицо = ВТ_ДанныеПоАптекам.ФизическоеЛицо
		|ГДЕ
		|	НачисленияЗППоАптекам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПоАптекам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_ЗПОбщая.ИНН КАК ИНН,
		|	ВТ_ДанныеПоАптекам.ВремяДень КАК ВремяДень,
		|	ВТ_ДанныеПоАптекам.СтоимостьДень КАК СтоимостьДень,
		|	ВТ_ДанныеПоАптекам.СуммаДень КАК СуммаДень,
		|	ВТ_ДанныеПоАптекам.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию,
		|	ВТ_ДанныеПоАптекам.ДоплатаЗаКатегориюСумма КАК ДоплатаЗаКатегориюСумма,
		|	ВТ_ДанныеПоАптекам.ВремяНочь КАК ВремяНочь,
		|	ВТ_ДанныеПоАптекам.СтоимостьНочногоЧаса КАК СтоимостьНочногоЧаса,
		|	ВТ_ДанныеПоАптекам.СуммаНочь КАК СуммаНочь,
		|	ВТ_ДанныеПоАптекам.ПремияНочная КАК ПремияНочная,
		|	ВТ_ДанныеПоАптекам.ПремияНочнаяСумма КАК ПремияНочнаяСумма,
		|	ВТ_ДанныеПоАптекам.ПраздникиВремяДень КАК ПраздникиВремяДень,
		|	ВТ_ДанныеПоАптекам.СтоимостьПраздники КАК СтоимостьПраздники,
		|	ВТ_ДанныеПоАптекам.СуммаПраздникиДень КАК СуммаПраздникиДень,
		|	ВТ_ДанныеПоАптекам.ПраздникиВремяНочь КАК ПраздникиВремяНочь,
		|	ВТ_ДанныеПоАптекам.СтоимостьПраздникиНочь КАК СтоимостьПраздникиНочь,
		|	ВТ_ДанныеПоАптекам.СуммаПраздникиНочь КАК СуммаПраздникиНочь,
		|	ВТ_ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ КАК ЛичнаяВыручкаНеДТМ,
		|	ВТ_ДанныеПоАптекам.ПоказательНеДТМ КАК ПоказательНеДТМ,
		|	ВТ_ДанныеПоАптекам.ПремияНеДТМ КАК ПремияНеДТМ,
		|	ВТ_ДанныеПоАптекам.ЛичнаяВыручкаДТМ КАК ЛичнаяВыручкаДТМ,
		|	ВТ_ДанныеПоАптекам.ПоказательДТМ КАК ПоказательДТМ,
		|	ВТ_ДанныеПоАптекам.ПремияДТМ КАК ПремияДТМ,
		|	ВТ_ДанныеПоАптекам.ЛичнаяВыручкаОптика КАК ЛичнаяВыручкаОптика,
		|	ВТ_ДанныеПоАптекам.ПоказательОптики КАК ПоказательОптики,
		|	ВТ_ДанныеПоАптекам.ПремияОптики КАК ПремияОптики,
		|	ВТ_ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ КАК СуммаПродажСрокиИЗМЗ,
		|	ВЫБОР
		|		КОГДА ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ <> 0
		|			ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ / ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ * ВТ_ЗПОбщая.БонусЗМЗ, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПремияЗМЗ,
		|	ВТ_ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении КАК СуммаПродажТоваровНаПродвижении,
		|	ВЫБОР
		|		КОГДА ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении <> 0
		|			ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении / ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении * ВТ_ЗПОбщая.БонусАкции, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПремияТоваровНаПродвижении,
		|	ВТ_ДанныеПоАптекам.ПремияЗаСовмещение КАК ПремияЗаСовмещение,
		|	ОКР(ВТ_ЗПОбщая.КоррекцияПремии1 * ВЫБОР
		|			КОГДА ВТ_ЗПОбщая.ИтогоДоГраниц = 0
		|				ТОГДА 0
		|			ИНАЧЕ (ВТ_ДанныеПоАптекам.СуммаДень + ВТ_ДанныеПоАптекам.СуммаНочь + ВТ_ДанныеПоАптекам.СуммаПраздникиДень + ВТ_ДанныеПоАптекам.СуммаПраздникиНочь + ВТ_ДанныеПоАптекам.ПремияНеДТМ + ВТ_ДанныеПоАптекам.ПремияДТМ + ВТ_ДанныеПоАптекам.ПремияОптики + ВЫБОР
		|					КОГДА ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении <> 0
		|						ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении / ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении * ВТ_ЗПОбщая.БонусАкции, 2)
		|					ИНАЧЕ 0
		|				КОНЕЦ + ВЫБОР
		|					КОГДА ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ <> 0
		|						ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ / ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ * ВТ_ЗПОбщая.БонусЗМЗ, 2)
		|					ИНАЧЕ 0
		|				КОНЕЦ) / ВТ_ЗПОбщая.ИтогоДоГраниц
		|		КОНЕЦ, 2) КАК КоррекцияПремии1,
		|	ОКР(ВТ_ЗПОбщая.КоррекцияПремии2 * ВЫБОР
		|			КОГДА ВТ_ЗПОбщая.ИтогоДоГраниц + ВТ_ЗПОбщая.Доплата1 = 0
		|				ТОГДА 0
		|			ИНАЧЕ (ВТ_ДанныеПоАптекам.СуммаДень + ВТ_ДанныеПоАптекам.СуммаНочь + ВТ_ДанныеПоАптекам.СуммаПраздникиДень + ВТ_ДанныеПоАптекам.СуммаПраздникиНочь + ВТ_ДанныеПоАптекам.ПремияНеДТМ + ВТ_ДанныеПоАптекам.ПремияДТМ + ВТ_ДанныеПоАптекам.ПремияОптики + ВЫБОР
		|					КОГДА ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении <> 0
		|						ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении / ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении * ВТ_ЗПОбщая.БонусАкции, 2)
		|					ИНАЧЕ 0
		|				КОНЕЦ + ВЫБОР
		|					КОГДА ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ <> 0
		|						ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ / ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ * ВТ_ЗПОбщая.БонусЗМЗ, 2)
		|					ИНАЧЕ 0
		|				КОНЕЦ + ВТ_ДанныеПоАптекам.ПремияЗаСовмещение) / (ВТ_ЗПОбщая.ИтогоДоГраниц + ВТ_ЗПОбщая.Доплата1)
		|		КОНЕЦ, 2) КАК КоррекцияПремии2,
		|	ВТ_ДанныеПоАптекам.СуммаДень + ВТ_ДанныеПоАптекам.СуммаНочь + ВТ_ДанныеПоАптекам.СуммаПраздникиДень + ВТ_ДанныеПоАптекам.СуммаПраздникиНочь + ВТ_ДанныеПоАптекам.ПремияНеДТМ + ВТ_ДанныеПоАптекам.ПремияДТМ + ВТ_ДанныеПоАптекам.ПремияОптики + ВЫБОР
		|		КОГДА ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении <> 0
		|			ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажТоваровНаПродвижении / ВТ_ЗПОбщая.СуммаПродажТоваровНаПродвижении * ВТ_ЗПОбщая.БонусАкции, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ <> 0
		|			ТОГДА ОКР(ВТ_ДанныеПоАптекам.СуммаПродажСрокиИЗМЗ / ВТ_ЗПОбщая.СуммаПродажСрокиИЗМЗ * ВТ_ЗПОбщая.БонусЗМЗ, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Всего,
		|	ВТ_ДанныеПоАптекам.Подразделение КАК Подразделение,
		|	ВТ_ДанныеПоАптекам.Должность КАК Должность,
		|	ВТ_ДанныеПоАптекам.РазрядКатегория КАК РазрядКатегория,
		|	ВТ_ДанныеПоАптекам.min КАК min,
		|	ВТ_ДанныеПоАптекам.max КАК max,
		|	ВТ_ДанныеПоАптекам.Коэффициент КАК Коэффициент,
		|	ВТ_ЗПОбщая.МинимумПоФакту КАК МинимумПоФакту,
		|	ВТ_ЗПОбщая.МаксимумПоФакту КАК МаксимумПоФакту,
		|	ВТ_ЗПОбщая.ВсегоПоРасчету КАК ВсегоПоРасчету_Общее,
		|	ВТ_ЗПОбщая.ИтогоДоГраниц КАК ИтогоДоГраниц_Общее,
		|	ВТ_ЗПОбщая.Доплата1 КАК Доплата1_Общее,
		|	ВТ_ЗПОбщая.КоррекцияПремии1 КАК КоррекцияПремии1_Общее,
		|	ВТ_ЗПОбщая.КоррекцияПремии2 КАК КоррекцияПремии2_Общее,
		|	ВТ_ЗПОбщая.ОтработаноВсего КАК ОтработаноВсего_Общее,
		|	ВТ_ДанныеПоАптекам.ПремияЗвонки КАК ПремияЗвонки,
		|	ВТ_ДанныеПоАптекам.ПремияСтрокиЗаказов КАК ПремияСтрокиЗаказов,
		|	ВТ_ДанныеПоАптекам.КолПринятыхЗвонков КАК КолПринятыхЗвонков,
		|	ВТ_ДанныеПоАптекам.КолСобранныхУпаковок КАК КолСобранныхУпаковок,
		|	ВТ_ДанныеПоАптекам.СтоимостьПринятогоЗвонка КАК СтоимостьПринятогоЗвонка,
		|	ВТ_ДанныеПоАптекам.СтоимостьСобраннойУпаковки КАК СтоимостьСобраннойУпаковки
		|ПОМЕСТИТЬ ВТ_ЗП1
		|ИЗ
		|	ВТ_ДанныеПоАптекам_ВыбраннаяАптека КАК ВТ_ДанныеПоАптекам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗПОбщая КАК ВТ_ЗПОбщая
		|		ПО ВТ_ДанныеПоАптекам.ФизическоеЛицо = ВТ_ЗПОбщая.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_ЗП1.ИНН КАК ИНН,
		|	ВТ_ЗП1.ВремяДень КАК ВремяДень,
		|	ВТ_ЗП1.СтоимостьДень КАК СтоимостьДень,
		|	ВТ_ЗП1.СуммаДень КАК СуммаДень,
		|	ВТ_ЗП1.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию,
		|	ВТ_ЗП1.ДоплатаЗаКатегориюСумма КАК ДоплатаЗаКатегориюСумма,
		|	ВТ_ЗП1.ВремяНочь КАК ВремяНочь,
		|	ВТ_ЗП1.СтоимостьНочногоЧаса КАК СтоимостьНочногоЧаса,
		|	ВТ_ЗП1.СуммаНочь КАК СуммаНочь,
		|	ВТ_ЗП1.ПремияНочная КАК ПремияНочная,
		|	ВТ_ЗП1.ПремияНочнаяСумма КАК ПремияНочнаяСумма,
		|	ВТ_ЗП1.ПраздникиВремяДень КАК ПраздникиВремяДень,
		|	ВТ_ЗП1.СтоимостьПраздники КАК СтоимостьПраздники,
		|	ВТ_ЗП1.СуммаПраздникиДень КАК СуммаПраздникиДень,
		|	ВТ_ЗП1.ПраздникиВремяНочь КАК ПраздникиВремяНочь,
		|	ВТ_ЗП1.СтоимостьПраздникиНочь КАК СтоимостьПраздникиНочь,
		|	ВТ_ЗП1.СуммаПраздникиНочь КАК СуммаПраздникиНочь,
		|	ВТ_ЗП1.ЛичнаяВыручкаНеДТМ КАК ЛичнаяВыручкаНеДТМ,
		|	ВТ_ЗП1.ПоказательНеДТМ КАК ПоказательНеДТМ,
		|	ВТ_ЗП1.ПремияНеДТМ КАК ПремияНеДТМ,
		|	ВТ_ЗП1.ЛичнаяВыручкаДТМ КАК ЛичнаяВыручкаДТМ,
		|	ВТ_ЗП1.ПоказательДТМ КАК ПоказательДТМ,
		|	ВТ_ЗП1.ПремияДТМ КАК ПремияДТМ,
		|	ВТ_ЗП1.ЛичнаяВыручкаОптика КАК ЛичнаяВыручкаОптика,
		|	ВТ_ЗП1.ПоказательОптики КАК ПоказательОптики,
		|	ВТ_ЗП1.ПремияОптики КАК ПремияОптики,
		|	ВТ_ЗП1.СуммаПродажСрокиИЗМЗ КАК СуммаПродажСрокиИЗМЗ,
		|	ВТ_ЗП1.ПремияЗМЗ КАК ПремияЗМЗ,
		|	ВТ_ЗП1.СуммаПродажТоваровНаПродвижении КАК СуммаПродажТоваровНаПродвижении,
		|	ВТ_ЗП1.ПремияТоваровНаПродвижении КАК ПремияТоваровНаПродвижении,
		|	ВТ_ЗП1.ПремияЗаСовмещение КАК ПремияЗаСовмещение,
		|	ВТ_ЗП1.КоррекцияПремии1 КАК КоррекцияПремии1,
		|	ВТ_ЗП1.КоррекцияПремии2 КАК КоррекцияПремии2,
		|	ВТ_ЗП1.Всего КАК Всего,
		|	ВТ_ЗП1.Подразделение КАК Подразделение,
		|	ВТ_ЗП1.Должность КАК Должность,
		|	ВТ_ЗП1.РазрядКатегория КАК РазрядКатегория,
		|	ВТ_ЗП1.min КАК min,
		|	ВТ_ЗП1.max КАК max,
		|	ВТ_ЗП1.Коэффициент КАК Коэффициент,
		|	ВТ_ЗП1.МинимумПоФакту КАК МинимумПоФакту,
		|	ВТ_ЗП1.МаксимумПоФакту КАК МаксимумПоФакту,
		|	ВЫБОР
		|		КОГДА ВТ_ЗП1.ОтработаноВсего_Общее <> 0
		|			ТОГДА ОКР(Больничные.Сумма * (ВТ_ЗП1.ВремяДень + ВТ_ЗП1.ВремяНочь + ВТ_ЗП1.ПраздникиВремяДень + ВТ_ЗП1.ПраздникиВремяНочь) / ВТ_ЗП1.ОтработаноВсего_Общее, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БольничныеСумма,
		|	ВЫБОР
		|		КОГДА ВТ_ЗП1.ОтработаноВсего_Общее <> 0
		|			ТОГДА ОКР(Отпуска.Сумма * (ВТ_ЗП1.ВремяДень + ВТ_ЗП1.ВремяНочь + ВТ_ЗП1.ПраздникиВремяДень + ВТ_ЗП1.ПраздникиВремяНочь) / ВТ_ЗП1.ОтработаноВсего_Общее, 2)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОтпускаСумма,
		|	Больничные.КоличествоДней КАК БольничныеДни,
		|	Отпуска.КоличествоДней КАК ОтпускаДни
		|ПОМЕСТИТЬ ВТ_ЗП2
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Больничные КАК Больничные
		|		ПО ВТ_ЗП1.ИНН = Больничные.ИНН
		|		ЛЕВОЕ СОЕДИНЕНИЕ Отпуска КАК Отпуска
		|		ПО ВТ_ЗП1.ИНН = Отпуска.ИНН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо КАК ФизическоеЛицо,
		|	""01 Отработано день, часы"" КАК Вид,
		|	ВТ_ЗП1.ВремяДень КАК Показатель,
		|	ВТ_ЗП1.СтоимостьДень КАК Тариф,
		|	ВТ_ЗП1.СуммаДень КАК Сумма
		|ПОМЕСТИТЬ ВТ_Объединение
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""02 Премия за категорию (почасовая)"",
		|	ВТ_ЗП1.ВремяДень,
		|	ВТ_ЗП1.ДоплатаЗаКатегорию,
		|	ВТ_ЗП1.ДоплатаЗаКатегориюСумма
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""03 Отработано ночь, часы"",
		|	ВТ_ЗП1.ВремяНочь,
		|	ВТ_ЗП1.СтоимостьНочногоЧаса,
		|	ВТ_ЗП1.СуммаНочь
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""04 Премия ночная (почасовая)"",
		|	ВТ_ЗП1.ВремяНочь,
		|	ВТ_ЗП1.ПремияНочная,
		|	ВТ_ЗП1.ПремияНочнаяСумма
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""05 Праздники день, часы"",
		|	ВТ_ЗП1.ПраздникиВремяДень,
		|	ВТ_ЗП1.СтоимостьПраздники,
		|	ВТ_ЗП1.СуммаПраздникиДень
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""06 Праздники ночь, часы"",
		|	ВТ_ЗП1.ПраздникиВремяНочь,
		|	ВТ_ЗП1.СтоимостьПраздникиНочь,
		|	ВТ_ЗП1.СуммаПраздникиНочь
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""07 Премия не ДТМ и не оптики"",
		|	ВТ_ЗП1.ЛичнаяВыручкаНеДТМ,
		|	ВТ_ЗП1.ПоказательНеДТМ,
		|	ВТ_ЗП1.ПремияНеДТМ
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""08 Премия ДТМ"",
		|	ВТ_ЗП1.ЛичнаяВыручкаДТМ,
		|	ВТ_ЗП1.ПоказательДТМ,
		|	ВТ_ЗП1.ПремияДТМ
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""09 Премия оптики"",
		|	ВТ_ЗП1.ЛичнаяВыручкаОптика,
		|	ВТ_ЗП1.ПоказательОптики,
		|	ВТ_ЗП1.ПремияОптики
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""10 Премия за маркетинг"",
		|	ВТ_ЗП1.СуммаПродажТоваровНаПродвижении,
		|	0,
		|	ВТ_ЗП1.ПремияТоваровНаПродвижении
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""11 Премия сроки и ЗМЗ"",
		|	ВТ_ЗП1.СуммаПродажСрокиИЗМЗ,
		|	0,
		|	ВТ_ЗП1.ПремияЗМЗ
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""12 Премия за собранные упаковки по заказам, принятых конс. ИА"",
		|	ВТ_ЗП1.КолСобранныхУпаковок,
		|	ВТ_ЗП1.СтоимостьСобраннойУпаковки,
		|	ВТ_ЗП1.ПремияСтрокиЗаказов
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""13 Премия принятые звонки консультантами ИА"",
		|	ВТ_ЗП1.КолПринятыхЗвонков,
		|	ВТ_ЗП1.СтоимостьПринятогоЗвонка,
		|	ВТ_ЗП1.ПремияЗвонки
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""14 Корректировка премии1 (min/max)"",
		|	0,
		|	0,
		|	ВТ_ЗП1.КоррекцияПремии1
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""15 Корректировка премии2"",
		|	0,
		|	0,
		|	ВТ_ЗП1.КоррекцияПремии2
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП2.ФизическоеЛицо,
		|	""16 Больничные, дни"",
		|	ВТ_ЗП2.БольничныеДни,
		|	0,
		|	ВТ_ЗП2.БольничныеСумма
		|ИЗ
		|	ВТ_ЗП2 КАК ВТ_ЗП2
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП2.ФизическоеЛицо,
		|	""17 Отпускные, дни"",
		|	ВТ_ЗП2.ОтпускаДни,
		|	0,
		|	ВТ_ЗП2.ОтпускаСумма
		|ИЗ
		|	ВТ_ЗП2 КАК ВТ_ЗП2
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗП1.ФизическоеЛицо,
		|	""18 Доплата за командировки"",
		|	0,
		|	0,
		|	ВТ_ЗП1.ПремияЗаСовмещение
		|ИЗ
		|	ВТ_ЗП1 КАК ВТ_ЗП1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Объединение.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_Объединение.Вид КАК Вид,
		|	СУММА(ЕСТЬNULL(ВТ_Объединение.Показатель, 0)) КАК Показатель,
		|	ЕСТЬNULL(ВТ_Объединение.Тариф, 0) КАК Тариф,
		|	СУММА(ВТ_Объединение.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_Объединение КАК ВТ_Объединение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Объединение.ФизическоеЛицо,
		|	ВТ_Объединение.Вид,
		|	ЕСТЬNULL(ВТ_Объединение.Тариф, 0)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_ЗП1.ИНН КАК ИНН,
		|	ВТ_ЗП1.Подразделение КАК Подразделение,
		|	ВТ_ЗП1.Должность КАК Должность,
		|	ВТ_ЗП1.РазрядКатегория КАК РазрядКатегория,
		|	ВТ_Итог.Вид КАК Вид,
		|	ВТ_Итог.Показатель КАК Показатель,
		|	ВТ_Итог.Тариф КАК Тариф,
		|	ВТ_Итог.Сумма КАК Сумма,
		|	ВТ_ЗП1.Коэффициент КАК Коэффициент,
		|	ВТ_ЗП1.МинимумПоФакту КАК МинимумПоФакту,
		|	ВТ_ЗП1.МаксимумПоФакту КАК МаксимумПоФакту
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗП1 КАК ВТ_ЗП1
		|		ПО ВТ_Итог.ФизическоеЛицо = ВТ_ЗП1.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_Итог.ФизическоеЛицо.Наименование,
		|	Вид";
	
	ТаблицаИтог = Запрос.Выполнить().Выгрузить();
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();	
	ДокументРезультат.Очистить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ВнешнийИД =  Новый Структура("ТаблицаИтог", ТаблицаИтог);
	
	// Создадим и инициализируем процессор компоновки.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийИД , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	// Обозначим начало вывода.
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

	
КонецПроцедуры
